_posts/language/2024-05-20-piece-de-resistance.html
---
layout: post
title: 单词本：pièce de résistance
tags: [English,Français]
categories: [language]
---
---
layout: post
title: 单词本：pièce de résistance
tags: [English,Français]
categories: [language]
---
<p>
还是在看看<a href="./2024-05-18-bane">Programming TypeScript</a> (<a href="#citeproc_bib_item_1">Cherny 2019</a>)的时候，读到这句：
</p>

<p>
You are now ready for TypeScript&rsquo;s <b>pièce de résistance</b> (or <b>raison
d&rsquo;être</b>, if you&rsquo;re a functional programmer): functions.
</p>

<p>
这里，用到了两个法语外来词。括号里的<b>raison d&rsquo;ê tre</b> ，之前我看《The Art
of Agile Product Ownership》(<a href="#citeproc_bib_item_2">Kelly 2019</a>)的时候，遇到过，写了
<a href="./2024-03-23-raison-d-etre">《单词本：raison d&rsquo;ê tre 》</a>。
</p>

<p>
而 <b>pi èce de ré sistance</b> 的意思则是 the best and most important or
exciting thing, often the last in a series of things。本来其实是法餐里的主菜chef-d&rsquo;œuvre的意思，引申为代表作品、最精彩的部分。
</p>

<p>
前面的这段话意思是说函数是 TypeScript 里最精彩的部分，是函数式程序员存在的意义。
</p>

<p>
比如：
</p>
<ul class="org-ul">
<li>The <b>pièce de résistance</b> was undoubtedly the creme brulee with
strawberry compote.  奶油布雷+草莓果盘无疑是主菜。</li>
<li>The <b>pièce de résistance</b> of the whole concert was when the two bands
came onstage to perform together. 两支乐队合奏是整个音乐会最精彩部分。</li>
<li>The waiter suggested we try the restaurant&rsquo;s <b>pièce de résistance</b>:
the chocolate soufflé. 服务员建议餐馆的必点菜：巧克力舒芙蕾。</li>
</ul>

<p>
德语的翻译是die Krönung加冕仪式。这是国王的高光时刻，所以就是宴会、演出的精彩部分。
</p>

<p>
比如Eine Tanzvorführung bildete die <b>Krönung</b> des Abends.舞蹈表演成为晚会的精彩部分。
</p>

<p>
Als <b>Krönung</b> des Festes wurde das Feuerwerk. 烟花表演成为庆祝活动的最精彩部分。
</p>

<p>
话说，das Feuerwerk 英语是 firework ，而法语则是 pi èce d&rsquo;artifice也有
pièce 呢。
</p>
